import { metaDataType } from '~/types/meta'

const metaData: metaDataType = {
  base: {
    domain: 'https://moonshot-harmony.jp/',
    ogp: '/assets/img/common/ogp.png',
  },
  pages: [
    {
      id: 'home',
      title:
        'ムーンショット型研究開発事業 ミレニア・プログラム科学技術による「人類の調和」検討チーム',
      description:
        '分断を克服し、人類の調和を実現するための研究開発のあり方（ムーンショット目標候補）について調査研究を行っています。',
      keywords:
        'ムーンショット型研究開発事業,ミレニア・プログラム,MSミレニア「人類の調和」プロジェクト,人類の調和,内閣府,JST',
      path: '/',
    },
    {
      id: 'about2050',
      title:
        'ムーンショット型研究開発事業 ミレニア・プログラム科学技術による「人類の調和」検討チーム',
      description:
        '分断を克服し、人類の調和を実現するための研究開発のあり方（ムーンショット目標候補）について調査研究を行っています。',
      keywords:
        'ムーンショット型研究開発事業,ミレニア・プログラム,MSミレニア「人類の調和」プロジェクト,人類の調和,内閣府,JST',
      path: '/about2050/',
    },
    {
      id: 'news',
      title:
        'ムーンショット型研究開発事業 ミレニア・プログラム科学技術による「人類の調和」検討チーム',
      description:
        '分断を克服し、人類の調和を実現するための研究開発のあり方（ムーンショット目標候補）について調査研究を行っています。',
      keywords:
        'ムーンショット型研究開発事業,ミレニア・プログラム,MSミレニア「人類の調和」プロジェクト,人類の調和,内閣府,JST',
      path: '/',
    },
    {
      id: 'member',
      title:
        'ムーンショット型研究開発事業 ミレニア・プログラム科学技術による「人類の調和」検討チーム',
      description:
        '分断を克服し、人類の調和を実現するための研究開発のあり方（ムーンショット目標候補）について調査研究を行っています。',
      keywords:
        'ムーンショット型研究開発事業,ミレニア・プログラム,MSミレニア「人類の調和」プロジェクト,人類の調和,内閣府,JST',
      path: '/member/',
    },
    {
      id: 'information',
      title:
        'ムーンショット型研究開発事業 ミレニア・プログラム科学技術による「人類の調和」検討チーム',
      description:
        '分断を克服し、人類の調和を実現するための研究開発のあり方（ムーンショット目標候補）について調査研究を行っています。',
      keywords:
        'ムーンショット型研究開発事業,ミレニア・プログラム,MSミレニア「人類の調和」プロジェクト,人類の調和,内閣府,JST',
      path: '/information/',
    },
  ],
}

export { metaData }
